---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected
source: html/ed2f6f98-a69e-257b-9c94-732f294fd16a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.FamilyDoesntMatchSystemPropertiesDisconnected Property

The family no longer matches the properties for the System. Disconnect the family from the System?

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesDisconnected { get; }
```